src/assets/Request_GenerarCFDI40.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:tes="http://schemas.datacontract.org/2004/07/TES.V33.CFDI.Negocios">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GenerarCFDI40>
         <!--Optional:-->
          <tem:credenciales>
            <!--Optional:-->
            <tes:Cuenta>TES030201001</tes:Cuenta>
            <!--Optional:-->
            <tes:Password>TES030201001j+</tes:Password>
            <!--Optional:-->
            <tes:Usuario>TES030201001</tes:Usuario>
         </tem:credenciales>
         <!--Optional:-->
         <tem:cfdi>
            <!--Optional:-->
            <tes:ClaveCFDI>FAC</tes:ClaveCFDI>
            <!--Optional:-->   
            <!--Optional:-->
            <tes:Conceptos>
               <!--Zero or more repetitions:-->
               <tes:Concepto40R>
                  <!--Optional:-->
                  <tes:Cantidad>1.00</tes:Cantidad>
                  <!--Optional:-->
                  <tes:ClaveProdServ>01010101</tes:ClaveProdServ>
                  <!--Optional:-->
                  <tes:ClaveUnidad>ZZ</tes:ClaveUnidad>
                  <!--Optional:-->
                  <tes:Descripcion>REPARACION DE EQUIPO</tes:Descripcion>
                  <!--Optional:-->
                  <tes:Importe>200.00</tes:Importe>
                  <!--Optional:-->
                  <tes:Impuestos>
                     <!--Optional:-->
                     <tes:Traslados>
                        <!--Zero or more repetitions:-->
                        <tes:TrasladoConcepto40R>
                           <!--Optional:-->
                           <tes:Base>200.00</tes:Base>
                           <!--Optional:-->
                           <tes:Importe>32.00</tes:Importe>
                           <!--Optional:-->
                           <tes:Impuesto>002</tes:Impuesto>
                           <!--Optional:-->
                           <tes:TasaOCuota>0.160000</tes:TasaOCuota>
                           <!--Optional:-->
                           <tes:TipoFactor>Tasa</tes:TipoFactor>
                        </tes:TrasladoConcepto40R>
                     </tes:Traslados>
                     <!--Optional:-->
                  </tes:Impuestos>
                  <!--Optional:-->
                  <tes:NoIdentificacion>O.S.</tes:NoIdentificacion>
                  <!--Optional:-->
                  <tes:ObjetoImp>02</tes:ObjetoImp>
                  <!--Optional:-->
                  <tes:Unidad>INDEFINIDO</tes:Unidad>
                  <!--Optional:-->
                  <tes:ValorUnitario>200.00</tes:ValorUnitario>
                  <!--Optional:-->
               </tes:Concepto40R>
			   
			   <tes:Concepto40R>
                  <!--Optional:-->
                  <tes:Cantidad>1.00</tes:Cantidad>
                  <!--Optional:-->
                  <tes:ClaveProdServ>01010101</tes:ClaveProdServ>
                  <!--Optional:-->
                  <tes:ClaveUnidad>ZZ</tes:ClaveUnidad>
                  <!--Optional:-->
                  <tes:Descripcion>PELICULA P/FUSOR HP 1000/1200/1300, O.S 2772</tes:Descripcion>
                  <!--Optional:-->
                  <tes:Importe>152.75</tes:Importe>
                  <!--Optional:-->
                  <tes:Impuestos>
                     <!--Optional:-->
                     <tes:Traslados>
                        <!--Zero or more repetitions:-->
                        <tes:TrasladoConcepto40R>
                           <!--Optional:-->
                           <tes:Base>152.75</tes:Base>
                           <!--Optional:-->
                           <tes:Importe>24.44</tes:Importe>
                           <!--Optional:-->
                           <tes:Impuesto>002</tes:Impuesto>
                           <!--Optional:-->
                           <tes:TasaOCuota>0.160000</tes:TasaOCuota>
                           <!--Optional:-->
                           <tes:TipoFactor>Tasa</tes:TipoFactor>
                        </tes:TrasladoConcepto40R>
                     </tes:Traslados>
                     <!--Optional:-->
                  </tes:Impuestos>
                  <!--Optional:-->
                  <tes:NoIdentificacion>PAPEL40</tes:NoIdentificacion>
                  <!--Optional:-->
                  <tes:ObjetoImp>02</tes:ObjetoImp>
                  <!--Optional:-->
                  <tes:Unidad>INDEFINIDO</tes:Unidad>
                  <!--Optional:-->
                  <tes:ValorUnitario>152.75</tes:ValorUnitario>
                  <!--Optional:-->
               </tes:Concepto40R>
            </tes:Conceptos>
            <!--Optional:-->
            <tes:CondicionesDePago>CONTADO</tes:CondicionesDePago>
            <!--Optional:-->
            <tes:Emisor>
               <!--Optional:-->
               <tes:Nombre>Compuhipermegared</tes:Nombre>
               <!--Optional:-->
               <tes:RegimenFiscal>601</tes:RegimenFiscal>
            </tes:Emisor>
			<!--Optional:-->
			<tes:Exportacion>01</tes:Exportacion>
            <!--Optional:-->
            <tes:FormaPago>01</tes:FormaPago>
            <!--Optional:-->
            <tes:LugarExpedicion>72000</tes:LugarExpedicion>
            <!--Optional:-->
            <tes:MetodoPago>PUE</tes:MetodoPago>
            <!--Optional:-->
            <tes:Moneda>MXN</tes:Moneda>
            <!--Optional:-->
            <tes:Receptor>
               <!--Optional:-->
               <tes:DomicilioFiscalReceptor>72000</tes:DomicilioFiscalReceptor>
               <!--Optional:-->
               <tes:Nombre>Pablo Neruda Perez</tes:Nombre>
               <!--Optional:-->
               <tes:RegimenFiscalReceptor>612</tes:RegimenFiscalReceptor>
               <!--Optional:-->
               <tes:Rfc>TEST010203001</tes:Rfc>
               <!--Optional:-->
               <tes:UsoCFDI>G03</tes:UsoCFDI>
            </tes:Receptor>
            <!--Optional:-->
            <tes:Referencia>0001</tes:Referencia>
            <!--Optional:-->
            <tes:SubTotal>352.75</tes:SubTotal>
            <!--Optional:-->
            <tes:TipoCambio>1</tes:TipoCambio>
            <!--Optional:-->
            <tes:Total>409.19</tes:Total>
            <!--Optional:-->
         </tem:cfdi>
      </tem:GenerarCFDI40>
   </soapenv:Body>
</soapenv:Envelope>